InformationRegisters/СведенияОСтавкахНалоговСборовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСтавкахНалоговСборовОтчислений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОСтавкахНалоговСборовОтчислений/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20200101')
			И ЗначениеЗаполнено(СтрокаНабора.ВидДохода)
			И СтрокаНабора.ВидДохода <> Справочники.ВидыДоходов.ДоходыОтРаботодателя Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Невозможно указать сведения о ставках налогов, сборов, отчислений для организации ""%1"" и вида дохода ""%2"" за период %3 года. 
										|Сведения о ставках налогов, сборов, отчислений в разрезе вида дохода отличного от ""Доходы от работодателя"" указываются только с 01.01.2020 года для взносов ОПВ.'"),
							СтрокаНабора.Организация,СтрокаНабора.ВидДохода,Формат(СтрокаНабора.Период,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецЕсли;
		
		Если СтрокаНабора.Период >= Дата('20220101')
			И ЗначениеЗаполнено(СтрокаНабора.ВидДохода)
			И (СтрокаНабора.ВидДохода <> Справочники.ВидыДоходов.ДоходыОтРаботодателя
				И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.ОПВ
				И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.ОПВР
				И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.СН
				И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.СО) Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Невозможно указать сведения о ставках налогов, сборов, отчислений для организации ""%1"" и вида дохода ""%2"" за период %3 года. 
										|Сведения о ставках налогов, сборов, отчислений в разрезе вида дохода отличного от ""Доходы от работодателя"", ""Доход субъекта предпринимательства"" указываются только для взносов ОПВ, ОПВР, СН и СО.'"),
							СтрокаНабора.Организация,СтрокаНабора.ВидДохода,Формат(СтрокаНабора.Период,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		ИначеЕсли СтрокаНабора.Период >= Дата('20200101')
			И СтрокаНабора.Период < Дата('20220101')
			И ЗначениеЗаполнено(СтрокаНабора.ВидДохода)
			И (СтрокаНабора.ВидДохода <> Справочники.ВидыДоходов.ДоходыОтРаботодателя
				И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.ОПВ
				И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.ОПВР
				И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.СО) Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Невозможно указать сведения о ставках налогов, сборов, отчислений для организации ""%1"" и вида дохода ""%2"" за период %3 года. 
										|Сведения о ставках налогов, сборов, отчислений в разрезе вида дохода отличного от ""Доходы от работодателя"", ""Доход субъекта предпринимательства"" указываются только для взносов ОПВ и СО.'"),
							СтрокаНабора.Организация,СтрокаНабора.ВидДохода,Формат(СтрокаНабора.Период,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		ИначеЕсли СтрокаНабора.Период >= Дата('20200101')
			И СтрокаНабора.Период < Дата('20210101')
			И ЗначениеЗаполнено(СтрокаНабора.ВидДохода)
			И СтрокаНабора.ВидДохода <> Справочники.ВидыДоходов.ДоходыОтРаботодателя
			И СтрокаНабора.ВидНалогаВзносаОтчисления <> Перечисления.ВидыНалоговВзносовОтчислений.ОПВ Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Невозможно указать сведения о ставках налогов, сборов, отчислений для организации ""%1"" и вида дохода ""%2"" за период %3 года. 
										|Сведения о ставках налогов, сборов, отчислений в разрезе вида дохода отличного от ""Доходы от работодателя"" указываются только для взносов ОПВ.'"),
							СтрокаНабора.Организация,СтрокаНабора.ВидДохода,Формат(СтрокаНабора.Период,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства Тогда
			
			Если СтрокаНабора.Период < Дата('20210101') Тогда
				
				ТекстОшибки = НСтр("ru = 'Сведения о ставках налогов, сборов, отчислений в разрезе вида дохода ""Доход субъекта предпринимательства"" указываются только с 01.01.2021 года.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
					
			ИначеЕсли СтрокаНабора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СН Тогда
					
				ТекстОшибки = НСтр("ru = 'Для вида дохода ""Доход субъекта предпринимательства"" расчет СН происходит без указания ставки.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
			
			Если СтрокаНабора.Период < Дата('20230101') Тогда
				
				ТекстОшибки = НСтр("ru = 'Сведения о ставке единого платежа указываются только с 01.01.2023 года.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
					
			КонецЕсли;
			
			Если НЕ СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя Тогда
				
				ТекстОшибки = НСтр("ru = 'Сведения о ставке единого платежа указываются только для вида дохода ""Доход работодателя"".'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
					
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНабора.Организация) Тогда
				
				ТекстОшибки = НСтр("ru = 'Сведения о ставке единого платежа указываются в целом для учета.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВР Тогда
			
			Если СтрокаНабора.Период < Дата('20240101') Тогда
				ТекстОшибки = НСтр("ru = 'Сведения о ставках по обязательным пенсионным взносам работодателя указываются с 01.01.2024 года.'");

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);

			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНабора.Организация) Тогда
				
				ТекстОшибки = НСтр("ru = 'Сведения о ставке обязательных пенсионных взносов работодателя указываются в целом для учета.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
					
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
